# -*- coding: utf-8 -*-
#5. Вывести на экран коды и символы таблицы ASCII,
#начиная с символа под номером 32 и заканчивая 127-м включительно.
#Вывод выполнить в табличной форме: по десять пар "код-символ" в каждой строке.

a = 32
z = 127
row_s = ''
ind = 0

while (a <= z):
    while (ind < 10 and a <= z):
        row_s = (f'{row_s}{a} {chr(a)} ')
        a = a + 1
        ind = ind + 1
    print(row_s)
    row_s = ''
    ind = 0

